document.addEventListener("DOMContentLoaded", () => {

  zero = {
    title: "أعمالي",
    id: "z",
    items: [{
        title: "اللوائح",
        link: "اللوائح"
      },
      {
        title: "لقاء الامهات للاسبوع التمهيدي والتعريف بالخطط",
        link: "لقاء الامهات للاسبوع التمهيدي والتعريف بالخطط"
      },
      {
        title: "لقاء الخطط المطورة ",
        link: "لقاء الخطط المطورة "
      },
      {
        title: "مايخص الطالب",
        link: "مايخص الطالب "
      }
    ]
  };

  first = {
    title: "أدلة التعليم",
    id: "f",
    items: [{
        title: "الدليل المدرسي للنماذج التشغيلية",
        link: "schoolGuide"
      },
      {
        title: "الخطط الدراسية المطورة",
        link: "الخطة الدراسية المطورة"
      },
      {
        title: "الدليل الاجرائي لمدارس التعليم العام",
        link: "الدليل الاجرائي"
      },
      {
        title: "الدليل التنظيمي لمدارس التعليم العام",
        link: "الدليل التنظيمي للمدارس _6.5"
      },
      {
        title: "تقويم الأداء الوظيفي لشاغلي الوظائف التنفيذية",
        link: "تقويم الأداء الوظيفي"
      }
    ]
  };

  second = {
    title: "الشراكة الأسرية والمجتمعية",
    id: "s",
    items: [{
        title: "الدليل التنظيمي لشراكة المدرسة مع الأسرة والمجتمع",
        link: "1481"
      },
      {
        title: "الدليل الاجرائي لشراكة المدرسة مع الأسرة والمجتمع",
        link: "الدليل الإجرائي-2"
      },
      {
        title: "ميثاق الشراكة بين المدرسة والأسرة",
        link: "الميثاق-3"
      }
    ]
  };

  third = {
    title: "ما يتعلق بالطالب",
    id: "t",
    items: [{
        title: "الدليل التنظيمي قواعد السلوك والمواظبة لطلاب وطالبات المرحلة الابتدائية",
        link: "الدليل التنظيمي لقواعد السلوك والموظبة المرحلة الابتدائية- التوجية والارشاد"
      },
      {
        title: "الدليل الاجرائي قواعد السلوك والمواظبة لطلاب وطالبات المرحلة الابتدائية",
        link: "الدليل_الإجرائي_لطباعة_النمااذج. ملتقى المعلمين والمعلمات"
      },
      {
        title: "المذكرة التفسيرية والقواعد التنفيذية للائحة تقويم الطالب",
        link: "المذكرة التفسيرية ١٤٤٣"
      },
      {
        title: "توزيع درجات المواد الدراسية وفق لائحة تقويم الطالب",
        link: "توزيع الدرجات١٤٤٣"
      },
      {
        title: "دليل القبول والتسجيل في التعليم العام",
        link: "دليل القبول والتسجيل المحدث37-38"
      },
      {
        title: "لائحة تقويم الطالب",
        link: "لائحة_تقويم_الطالب_في_التعليم_العام_1443هـ"
      }
    ]
  };

  fourth = {
    title: "أدلة الأمن والسلامة",
    id: "fo",
    items: [{
        title: "دليل عمليات الاخلاء في المنشآت التعليمية",
        link: "Evacuation 2"
      },
      {
        title: "دليل تعليق الدراسة وآلية البلاغات",
        link: "suspension"
      },
      {
        title: "التوصيف الفني لتجهيزات السلامة والإطفاء والإنذار في المدارس",
        link: "التوصيف الفني لتجهيزات السلامة والإطفاء والإنذار في المدارس"
      },

    ]
  };

  fifth = {
    title: "اللوائح والأدلة المنظمة للعمل",
    id: "fi",
    items: [{
        title: "إطار العمل التنظيمي للائحة الوظائف التعليمية",
        link: "2292021"
      },
      {
        title: "لائحة الوظائف التعليمية",
        link: "12012021"
      },
      {
        title: "أطر العمل التنظيمية للائحة التنفيذية للموارد البشرية",
        link: "أطر_العمل_التنظيمية_للائحة_التنفيذية_للموارد_البشرية_١٤٤٢هـ"
      },
      {
        title: "الدليل الإجرائي لقضايا شاغلي الوظائف التعليمية",
        link: "الدليل الاجرائي لقضايا شاغلي الوظائف التعليمية"
      },
      {
        title: "دليل الاستثناء من لقاحات كوڤيد",
        link: "دليل الاستثناء من لقاحات كوفيد"
      },
      {
        title: "اللائحة التنفيذية للموارد البشرية في الخدمة المدنية",
        link: "اللائحة التنفيذية - للموارد البشرية في الخدمة المدنية  - ذو القعدة 1442هـ"
      },
      {
        title: "لائحة الحقوق والمزايا المالية",
        link: "لائحة الحقوق والمزايا المالية - الهوية الجديدة ذوالقعدة 1442هـ"
      },
      {
        title: "مدونة السلوك الوظيفي وأخلاقيات الوظيفة العامة",
        link: "مدونة السلوك الوظيفي"
      }
    ]
  };

  all = [zero, first, second, third, fourth, fifth];
  container = document.getElementById("cont");

  all.forEach((category, i) => {
    var inner = `<div class="card">
        <div class="card-header">
          <h4 class="mb-0">${category.title}</h4>
        </div>
        <ul class="list-group list-group-flush">
        ${category.items.map(f => `
      <li class="list-group-item"><a href="files/${category.id}/${f.link}.pdf" class="card-link">${f.title}</a></li>
          `).join('')}
        </ul>
      </div>`;
      var col = document.createElement("DIV");
      col.classList.add("col");
      col.innerHTML = inner;
      container.appendChild(col);
  });

  // <div class="col">
  //   <div class="card">
  //     <div class="card-header">
  //       <h4 class="mb-0">عنوان البطاقة</h4>
  //     </div>
  //     <ul class="list-group list-group-flush">
  //       <li class="list-group-item"><a href="#" class="card-link">رابط البطاقة</a></li>
  //       <li class="list-group-item"><a href="#" class="card-link">رابط البطاقة</a></li>
  //     </ul>
  //   </div>
  // </div>

});
